alrenyang/stm32h743zit6_TRI/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LCD_BAK_Pin GPIO_PIN_0
#define LCD_BAK_GPIO_Port GPIOA
#define KEY_DATA3_Pin GPIO_PIN_2
#define KEY_DATA3_GPIO_Port GPIOB
#define KEY_DATA0_Pin GPIO_PIN_11
#define KEY_DATA0_GPIO_Port GPIOA
#define KEY_DATA1_Pin GPIO_PIN_12
#define KEY_DATA1_GPIO_Port GPIOA
#define KEY_DATA2_Pin GPIO_PIN_15
#define KEY_DATA2_GPIO_Port GPIOA
#define LOCK_KEY_Pin GPIO_PIN_2
#define LOCK_KEY_GPIO_Port GPIOD
#define LOCAL_KEY_Pin GPIO_PIN_4
#define LOCAL_KEY_GPIO_Port GPIOD
#define REMOTE_KEY_Pin GPIO_PIN_7
#define REMOTE_KEY_GPIO_Port GPIOD
#define KEY_DATA4_Pin GPIO_PIN_3
#define KEY_DATA4_GPIO_Port GPIOB
#define EN_A_Pin GPIO_PIN_4
#define EN_A_GPIO_Port GPIOB
#define EN_B_Pin GPIO_PIN_5
#define EN_B_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
